cpp_itpp.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-15 Thu 01:00 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C++ - IT++</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">C++ - IT++</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org21739fd">Introduction</a></li>
<li><a href="#org88a7093">Installation</a>
<ul>
<li><a href="#org3d1db98">Install the third-party libraries</a></li>
<li><a href="#orgfa0e773">Install IT++</a></li>
</ul>
</li>
<li><a href="#org3c89c5b">Usage</a></li>
<li><a href="#org4bd7570">Interface</a></li>
</ul>
</div>
</div>

<div id="outline-container-org21739fd" class="outline-2">
<h2 id="org21739fd">Introduction</h2>
<div class="outline-text-2" id="text-org21739fd">
<p>
<i>IT++</i><sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> is a powerful C++ library, which is widely employed in the area of communication, esp. in simulation programming and computing. It has provided a variety of useful <i>classes</i>, e.g. <code>vector</code>, <code>matrix</code>. With the aid of IT++, programming in C++ is very similar to programming in <i>MATLAB</i>.
</p>

<p>
IT++ is released under <i>GPL</i>, and can work on all the platforms, including Unix/Linux, Windows an Mac OS X.
</p>
</div>
</div>
<div id="outline-container-org88a7093" class="outline-2">
<h2 id="org88a7093">Installation</h2>
<div class="outline-text-2" id="text-org88a7093">
<p>
Optionally, its functionality can be greatly extended based on existing open-source or commercial libraries, i.e.
</p>
<ul class="org-ul">
<li>Open-source libraries
<ul class="org-ul">
<li><a href="http://www.netlib.org/blas/">BLAS</a></li>
<li><a href="http://www.netlib.org/lapack/">LAPACK</a></li>
<li><a href="http://www.fftw.org/">FFTW</a></li>
</ul></li>
<li>Commercial libraries
<ul class="org-ul">
<li><a href="http://math-atlas.sourceforge.net/">ATLAS</a></li>
<li><a href="http://software.intel.com/en-us/intel-mkl/">MKL</a></li>
<li><a href="http://developer.amd.com/acml.aspx">ACML</a></li>
</ul></li>
</ul>
</div>
<div id="outline-container-org3d1db98" class="outline-3">
<h3 id="org3d1db98">Install the third-party libraries</h3>
<div class="outline-text-3" id="text-org3d1db98">
<p>
Herein, we take the open-source libraries above for instance. For <i>ArchLinux</i>, the installation can be performed by
</p>
<div class="org-src-container">
<pre class="src src-sh">pacman -S blas lapack fftw
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfa0e773" class="outline-3">
<h3 id="orgfa0e773">Install IT++</h3>
<div class="outline-text-3" id="text-orgfa0e773">
<p>
The lastest version of IT++ can be obtained via git, and installed to <code>/opt/itpp</code> by following commands.
</p>
<div class="org-src-container">
<pre class="src src-sh">git clone --depth=1 git://git.code.sf.net/p/itpp/git itpp-git
cd itpp-git
mkdir build
cd build
cmake .. -DCMAKE_INSTALL_PREFIX=/opt/itpp
make
make install
make clean
cd ..
rm -rf build
</pre>
</div>

<p>
What deserves notice, the commands above installs the <i>shared</i> libraries. For the static version, option <code>-DITPP_SHARED_LIB=off</code> of <code>cmake</code> should be used.
</p>

<p>
BTW, HTML documentation will be installed by default. Therefore, <i>doxygen</i> needs to be installed in advance. Otherwise, the documentation installation should be disabled by <code>-DHTML_DOCS=off</code> option of <code>cmake</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-org3c89c5b" class="outline-2">
<h2 id="org3c89c5b">Usage</h2>
<div class="outline-text-2" id="text-org3c89c5b">
<p>
IT++ provides a script <code>/opt/itpp/bin/itpp-config</code> to simplify the compilation and linking of IT++ based programs.
</p>

<p>
Targetting better utilization, creating following soft links is necessary.
</p>
<div class="org-src-container">
<pre class="src src-sh">ln -s /opt/itpp/bin/itpp-config /usr/local/bin
ln -s /opt/itpp/include/itpp /usr/local/include
</pre>
</div>
<p>
Create file <code>/etc/ld.so.conf.d/itpp.conf</code> with its content as follows.
</p>
<div class="org-src-container">
<pre class="src src-sh">/opt/itpp/lib
</pre>
</div>
<p>
Then, fresh the cache accordingly.
</p>
<div class="org-src-container">
<pre class="src src-sh">ldconfig
</pre>
</div>
</div>
</div>
<div id="outline-container-org4bd7570" class="outline-2">
<h2 id="org4bd7570">Interface</h2>
<div class="outline-text-2" id="text-org4bd7570">
<p>
IT++ has its own file format, with a suffix <code>.it</code>. Fortunately, for the sake of convenient file exchange, it provides
</p>
<ul class="org-ul">
<li>MATLAB functions <code>itload.m</code> and <code>itsave.m</code>.</li>
<li>Python module <code>pyitpp.py</code></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="http://itpp.sourceforge.net/">http://itpp.sourceforge.net/</a>
</p></div></div>


</div>
</div></div>
</body>
</html>
